name: "preprocess"
backend: "python"
max_batch_size: 4
input [
{
    name: "INPUT_IMAGE"
    data_type: TYPE_UINT8
    dims: [ -1, -1 ]
    allow_ragged_batch: true

},
{
    name: "INPUT_RESIZE_SHAPE"
    data_type: TYPE_INT32
    dims: [ 2 ]
}
]
 
output [
{
    name: "OUTPUT"
    data_type: TYPE_FP32
    dims: [ -1, -1, 1 ]
}
]

instance_group [{ kind: KIND_CPU, count: 1 }]
dynamic_batching { }
