name: "model_m3_big_256x256_328MB"
backend: "tensorflow"
platform: "tensorflow_savedmodel"
max_batch_size: 64
input [
  {
    name: "random_flip_input"
    data_type: TYPE_FP32
    dims: [ 256, 256, 1 ]
  }
]
output [
  {
    name: "dense_4"
    data_type: TYPE_FP32
    dims: [ 2 ]
  }
]
instance_group [{ kind: KIND_CPU, count: 1 }]
dynamic_batching { }