name: "model_m1_initial_256x256_102MB"
backend: "tensorflow"
platform: "tensorflow_savedmodel"
max_batch_size: 64
input [
  {
    name: "conv2d_input"
    data_type: TYPE_FP32
    dims: [ 256, 256, 1 ]
  }
]
output [
  {
    name: "dense_2"
    data_type: TYPE_FP32
    dims: [ 2 ]
  }
]
instance_group [{ kind: KIND_CPU, count: 1 }]
dynamic_batching { }