name: "ensemble"
platform: "ensemble"
max_batch_size: 64
input [
  {
    name: "INPUT"
    data_type: TYPE_UINT8
    dims: [ -1, -1 ]
    allow_ragged_batch: true
  }
]
output [
  {
    name: "OUTPUT"
    data_type: TYPE_FP32
    dims: [ 2 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      model_version: -1
      input_map {
        key: "INPUT_0"
        value: "INPUT"
      }
      output_map {
        key: "OUTPUT_0"
        value: "preprocessed_image"
      }
    },
    {
      model_name: "model_3_328mb"
      model_version: -1
      input_map {
        key: "random_flip_input"
        value: "preprocessed_image"
      }
      output_map {
        key: "dense_4"
        value: "OUTPUT"
      }
    }
  ]
}